app/Http/Controllers/LikeController.php

    public function like(Post $post)
    {
        // like button

        if ((bool) Like::where('user_id', auth()->id())->where('post_id', $post->id)->first()) {
            $post->likes()->detach(auth()->user());

            return response()->json(['likes' => count($post->likes)], 201);
        }
        $post->likes()->attach(auth()->user());
---
select * from `likes` where `user_id` = 2 and `post_id` = 39 limit 1
delete from `likes` where `post_id` = 39 and `user_id` in (2)
insert into `likes` (`created_at`, `post_id`, `updated_at`, `user_id`) values ('2019-08-01 09:54:21', 39, '2019-08-01 09:54:21', 2)